export const questions = [
  {
    id: 1,
    text: "Як часто протягом останніх двох тижнів ви відчували пригнічений настрій?",
    options: [
      { value: 0, label: "Ніколи" },
      { value: 1, label: "Кілька днів" },
      { value: 2, label: "Більше половини днів" },
      { value: 3, label: "Майже щодня" },
    ],
  },
  {
    id: 2,
    text: "Наскільки часто ви втрачали інтерес до справ, які раніше приносили задоволення?",
    options: [
      { value: 0, label: "Не втрачав(ла)" },
      { value: 1, label: "Іноді" },
      { value: 2, label: "Часто" },
      { value: 3, label: "Постійно" },
    ],
  },
  {
    id: 3,
    text: "Як часто ви відчували проблеми зі сном (безсоння або надмірна сонливість)?",
    options: [
      { value: 0, label: "Ніколи" },
      { value: 1, label: "Іноді" },
      { value: 2, label: "Часто" },
      { value: 3, label: "Щодня" },
    ],
  },
  {
    id: 4,
    text: "Як часто ви відчували втому або нестачу енергії?",
    options: [
      { value: 0, label: "Рідко" },
      { value: 1, label: "Час від часу" },
      { value: 2, label: "Часто" },
      { value: 3, label: "Постійно" },
    ],
  },
  {
    id: 5,
    text: "Як часто ви відчували труднощі з концентрацією уваги?",
    options: [
      { value: 0, label: "Рідко" },
      { value: 1, label: "Іноді" },
      { value: 2, label: "Часто" },
      { value: 3, label: "Постійно" },
    ],
  },
]; 