interface Option {
  value: number;
  label: string;
}

export interface Question {
  text: string;
  options: Option[];
}

const options: Option[] = [
  { value: 0, label: "Ніколи" },
  { value: 1, label: "Рідко" },
  { value: 2, label: "Іноді" },
  { value: 3, label: "Часто" },
  { value: 4, label: "Завжди" },
];

export const questions: Question[] = [
  {
    text: "Я відчуваю емоційне виснаження після робочого дня",
    options,
  },
  {
    text: "Мені важко знаходити мотивацію для виконання робочих завдань",
    options,
  },
  {
    text: "Я відчуваю, що моя робота не приносить мені задоволення",
    options,
  },
  {
    text: "Я став(ла) більш цинічним(ою) щодо своєї роботи",
    options,
  },
  {
    text: "Мені важко концентруватися на робочих завданнях",
    options,
  },
  {
    text: "Я відчуваю фізичну втому навіть після достатнього відпочинку",
    options,
  },
  {
    text: "Я помічаю, що стаю більш дратівливим(ою) з колегами або клієнтами",
    options,
  },
  {
    text: "Мені складно відключатися від думок про роботу у вільний час",
    options,
  },
  {
    text: "Я відчуваю, що моя продуктивність на роботі знизилася",
    options,
  },
  {
    text: "Я сумніваюся в цінності своєї роботи",
    options,
  },
  {
    text: "У мене виникають проблеми зі сном через думки про роботу",
    options,
  },
  {
    text: "Я відчуваю, що не маю достатньо енергії для виконання особистих справ після роботи",
    options,
  },
  {
    text: "Я помічаю, що став(ла) більш відстороненим(ою) від колег",
    options,
  },
  {
    text: "Мені важко відчувати ентузіазм щодо нових проектів",
    options,
  },
  {
    text: "Я відчуваю, що моя робота негативно впливає на моє здоров'я",
    options,
  },
]; 